Revit 2026 API

# MetalMetalPattern Property

---

The property labeled "Relief Pattern" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPattern { get; }
```
```vb
Public Shared ReadOnly Property MetalPattern As String
	Get
```
```cpp
public:
static property String^ MetalPattern {
	String^ get ();
}
```
```fsharp
static member MetalPattern : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPatternType".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace